#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_vpc.rdx_vpc: Refreshing state... [id=vpc-0abb1ba285dab1fe7]
data.aws_availability_zones.available: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0778521d914d23bc1]
aws_subnet.rdx_private_subnet[0]: Refreshing state... [id=subnet-0120053068898ae8a]
aws_route_table.rdx_private_route_table: Refreshing state... [id=rtb-0d3323a09361bca59]
aws_subnet.rdx_public_subnet[0]: Refreshing state... [id=subnet-095a49c44f7926363]
aws_security_group.rdx_public_security_group: Refreshing state... [id=sg-08f59bf0c563e5638]
aws_internet_gateway.rdx_internet_gateway: Refreshing state... [id=igw-04737c7169a9ac46d]
aws_security_group.rdx_private_security_group: Refreshing state... [id=sg-0d15a786761743c83]
aws_subnet.rdx_private_subnet[1]: Refreshing state... [id=subnet-01f4cfd7f67cd3c94]
aws_instance.full_node_ec2[0]: Refreshing state... [id=i-029a72dda64fed48e]
aws_security_group_rule.rdx_public_security_group_rules_ingress[0]: Refreshing state... [id=sgrule-3739581126]
aws_security_group_rule.rdx_public_security_group_rules_ingress[1]: Refreshing state... [id=sgrule-2317634057]
aws_security_group_rule.rdx_public_security_group_rules_egress[0]: Refreshing state... [id=sgrule-1600175434]
aws_security_group_rule.rdx_private_security_group_rules[0]: Refreshing state... [id=sgrule-103939214]
aws_db_subnet_group.rdx_private_subnet_group: Refreshing state... [id=rdx_private_subnet_group]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0425594785e07cdf5]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cf21ce5b14899eda]
aws_route_table.rdx_public_route_table: Refreshing state... [id=rtb-0316a8dd8224b9bf1]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-053b5a7235482463e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.fullnode_ips[0] will be created
  + resource "aws_eip" "fullnode_ips" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = "i-029a72dda64fed48e"
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "Full Node IP 0"
        }
      + tags_all             = {
          + "Name" = "Full Node IP 0"
        }
      + vpc                  = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @StatelessOddity, Action: `pull_request`*